tap "codecrafters-io/tap"
tap "libsql/sqld"
tap "ngrok/ngrok"
tap "sst/tap"
tap "tursodatabase/tap"
brew "openssl@3"
brew "readline"
brew "awscli"
brew "cmake"
brew "deno"
brew "fzf"
brew "gh"
brew "git"
brew "go"
brew "lazygit"
brew "libpq", link: true
brew "libyaml"
brew "maven"
brew "mise"
brew "neofetch"
brew "neovim"
brew "openjdk@17"
brew "php"
brew "pipx"
brew "protobuf"
brew "pyenv"
brew "python@3.10"
brew "ripgrep"
brew "rust"
brew "tre-command"
brew "tree"
brew "wget"
brew "yarn"
brew "zlib"
brew "zsh-autocomplete"
brew "codecrafters-io/tap/codecrafters"
brew "sst/tap/opencode"
brew "tursodatabase/tap/turso"
cask "font-iosevka"
cask "ghostty"
cask "ngrok"
cask "warp"
cask "zed"
vscode "atomiks.moonlight"
vscode "bradlc.vscode-tailwindcss"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "csstools.postcss"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "donjayamanne.python-environment-manager"
vscode "donjayamanne.python-extension-pack"
vscode "dsznajder.es7-react-js-snippets"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "golang.go"
vscode "gregorbiswanger.json2ts"
vscode "kevinrose.vsc-python-indent"
vscode "loiane.ts-extension-pack"
vscode "lucafalasco.matchalk"
vscode "merko.blue-theme"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "pkief.material-icon-theme"
vscode "pmndrs.pmndrs"
vscode "pmneo.tsimporter"
vscode "prisma.prisma"
vscode "qwtel.sqlite-viewer"
vscode "ritwickdey.liveserver"
vscode "stringham.move-ts"
vscode "supermaven.supermaven"
vscode "unifiedjs.vscode-mdx"
vscode "vue.volar"
vscode "yoavbls.pretty-ts-errors"
go "golang.org/x/tools/gopls"
go "honnef.co/go/tools/cmd/staticcheck"
